Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
/*
 * Copyright 2022, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file
 *  Defines the TLS Interface.
 *
 *  This file provides prototypes of functions for establishing
 *  TLS connections with a remote host.
 *
 */
#ifndef USE_TLS_WEAK

#include "cy_tls.h"
#include "cy_rtc.h"
#include "cyhal.h"
#include "cyabs_rtos.h"
#include "cy_log.h"
#include "cy_result_mw.h"
#include "cy_network_mw_core.h"
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <string.h>
#include <time.h>
#ifdef CY_TFM_PSA_SUPPORTED
#include <psa/crypto.h>
#endif

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
#include "tfm_mbedtls_version.h"
#include <mbedtls/version.h>
#include <mbedtls/pk.h>
#include <mbedtls/pk_internal.h>
#include <core_pkcs11_config.h>
#include <core_pkcs11.h>
#include <core_pki_utils.h>
#endif

#include <cy_tls_ciphersuites.h>

#ifdef ENABLE_SECURE_SOCKETS_LOGS
#define tls_cy_log_msg cy_log_msg
#else
#define tls_cy_log_msg(a,b,c,...)
#endif

/* Maximum TLS record size */
#define CY_TLS_PACKET_BUFFER_SIZE (16*1024)

/* ToDo: For server mode if the client x.509 authentication is enabled,
 * we need to provide number of certificates and certificates buffer to
 * NetXSecure to hold the remote host certificates. The following two macros are
 * added for this purpose. Need to finalize if adding socket options is better than macros.
 */
/* Maximum number of remote certificates */
#ifndef CY_TLS_MAX_NUM_CERTS
#define CY_TLS_MAX_NUM_CERTS 3
#endif

/* Maximum certificate size */
#ifndef CY_TLS_MAX_CERTIFICATE_SIZE
#define CY_TLS_MAX_CERTIFICATE_SIZE 2000
#endif

#define CY_TLS_LOAD_CERT_FROM_RAM                1
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
#define CY_TLS_LOAD_CERT_FROM_SECURE_STORAGE     0
#endif

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
typedef struct cy_tls_pkcs_context
{
    CK_FUNCTION_LIST_PTR        functionlist;
    CK_SESSION_HANDLE           session;
    CK_OBJECT_HANDLE            privatekey_obj;
    CK_KEY_TYPE                 key_type;
    mbedtls_pk_context          ssl_pk_ctx;
    mbedtls_pk_info_t           ssl_pk_info;
    bool                        load_rootca_from_ram;
    bool                        load_device_cert_key_from_ram;
} cy_tls_pkcs_context_t;
#endif

typedef struct cy_tls_context_nx_secure
{
    const char                 *server_name;
    const char                 *rootca_certificate;
    uint32_t                    rootca_certificate_length;
    NX_SECURE_X509_CERT        *nx_secure_ca_cert;
    unsigned char              *rootca_der;
    NX_TCP_SOCKET              *nx_tcp_socket;

    const char                **alpn_protocols;
    uint32_t                    alpn_protocols_count;
    bool                        tls_handshake_successful;
    void                       *caller_context;
    const void                 *tls_identity;
    int                         auth_mode;
    unsigned char               mfl_code;
    const char                **alpn_list;
    char                       *hostname;
    NX_SECURE_TLS_SESSION       tls_session;
    char                       *tls_metadata;
    unsigned char              *tls_packet_buffer;
    unsigned char              *certificate_buffer;
    NX_PACKET                  *packet;
    uint32_t                    offset;
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
    mbedtls_x509_crt            *cert_x509ca;
    mbedtls_x509_crt            *cert_client;
    bool                        load_rootca_from_ram;
    bool                        load_device_cert_key_from_ram;
    cy_tls_pkcs_context_t       pkcs_context;
#endif
} cy_tls_context_nx_secure_t;

typedef struct
{
    NX_SECURE_X509_CERT certificate;
    unsigned char *certificate_der;
    unsigned char *private_key_der;
    uint8_t is_client_auth;
} cy_tls_identity_t;

typedef enum
{
    CY_TLS_AUTH_MODE_VERIFY_NONE = 0,
    CY_TLS_AUTH_MODE_VERIFY_OPTIONAL = 1,
    CY_TLS_AUTH_MODE_REQUIRED = 2
} cy_tls_auth_mode_t;

typedef enum
{
    CY_TLS_PEM_TYPE_CERT = 0,
    CY_TLS_PEM_TYPE_KEY = 1
} cy_tls_pem_type_t;

static NX_SECURE_X509_CERT *root_ca_certificates = NULL;
static unsigned char *root_ca_certificates_der = NULL;

