Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
/* TLS library usage count */
static int init_ref_count = 0;

static const unsigned char base64_dec_map[128] =
{
    127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
    127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
    127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
    127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
    127, 127, 127,  62, 127, 127, 127,  63,  52,  53,
     54,  55,  56,  57,  58,  59,  60,  61, 127, 127,
    127,  64, 127, 127, 127,   0,   1,   2,   3,   4,
      5,   6,   7,   8,   9,  10,  11,  12,  13,  14,
     15,  16,  17,  18,  19,  20,  21,  22,  23,  24,
     25, 127, 127, 127, 127, 127, 127,  26,  27,  28,
     29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
     39,  40,  41,  42,  43,  44,  45,  46,  47,  48,
     49,  50,  51, 127, 127, 127, 127, 127
};

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
static CK_RV cy_tls_initialize_client_credentials(cy_tls_context_mbedtls_t* context);
#endif
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
static cy_rslt_t convert_pkcs_error_to_tls(CK_RV result)
{
    switch( result )
    {
        case CKR_OK:
            return CY_RSLT_SUCCESS;
        case CKR_HOST_MEMORY:
            return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
        case CKR_ARGUMENTS_BAD:
            return CY_RSLT_MODULE_TLS_BADARG;
        case CKR_GENERAL_ERROR:
        default:
            return CY_RSLT_MODULE_TLS_PKCS_ERROR;
    }
}
#endif


static int cy_tls_base64_decode( const unsigned char *inbuf, size_t inbuflen, unsigned char *outbuf, size_t outbuflen, size_t *bytescopied)
{
    size_t i, n;
    uint32_t j, x;
    unsigned char *p;

    /* First pass: check for validity and get output length */
    for( i = n = j = 0; i < inbuflen; i++ )
    {
        /* Skip spaces before checking for EOL */
        x = 0;
        while( i < inbuflen && inbuf[i] == ' ' )
        {
            ++i;
            ++x;
        }

        /* Spaces at end of buffer are OK */
        if( i == inbuflen )
            break;

        if( ( inbuflen - i ) >= 2 &&
            inbuf[i] == '\r' && inbuf[i + 1] == '\n' )
            continue;

        if( inbuf[i] == '\n' )
            continue;

        /* Space inside a line is an error */
        if( x != 0 )
            return( -1 );

        if( inbuf[i] == '=' && ++j > 2 )
            return( -1 );

        if( inbuf[i] > 127 || base64_dec_map[inbuf[i]] == 127 )
            return( -1 );

        if( base64_dec_map[inbuf[i]] < 64 && j != 0 )
            return( -1 );

        n++;
    }

    if( n == 0 )
    {
        *bytescopied = 0;
        return( 0 );
    }

    /* The following expression is to calculate the following formula without
     * risk of integer overflow in n:
     *     n = ( ( n * 6 ) + 7 ) >> 3;
     */
    n = ( 6 * ( n >> 3 ) ) + ( ( 6 * ( n & 0x7 ) + 7 ) >> 3 );
    n -= j;

    if( outbuf == NULL || outbuflen < n )
    {
        *bytescopied = n;
        return( -2 );
    }

   for( j = 3, n = x = 0, p = outbuf; i > 0; i--, inbuf++ )
   {
        if( *inbuf == '\r' || *inbuf == '\n' || *inbuf == ' ' )
            continue;

        j -= ( base64_dec_map[*inbuf] == 64 );
        x  = ( x << 6 ) | ( base64_dec_map[*inbuf] & 0x3F );

        if( ++n == 4 )
        {
            n = 0;
            if( j > 0 ) *p++ = (unsigned char)( x >> 16 );
            if( j > 1 ) *p++ = (unsigned char)( x >>  8 );
            if( j > 2 ) *p++ = (unsigned char)( x       );
        }
    }

    *bytescopied = p - outbuf;

    return( 0 );
}

static char* cy_tls_strnstr(const char *string, const char *sub_string, size_t length)
{
    char *ptr = NULL, *new_string = NULL;
    new_string = (char *)calloc((length + 1), 1);
    memcpy(new_string, string, length);
    ptr = strstr(new_string, sub_string);
    free(new_string);
    if(ptr != NULL)
    {
        return (strstr(string, sub_string));
    }
    return NULL;
}

static INT cy_tls_parse_private_key(const char *private_key, UINT *private_key_type)
{
    unsigned char *header=NULL;
    unsigned char *footer=NULL;

    header = (unsigned char *) strstr( private_key, "-----BEGIN RSA PRIVATE KEY-----");
    footer = (unsigned char *) strstr( private_key, "-----END RSA PRIVATE KEY-----");

    if( header != NULL && footer != NULL && (const char *)header == private_key )
    {
        *private_key_type = NX_SECURE_X509_KEY_TYPE_RSA_PKCS1_DER;
        return 0;
    }

    header = (unsigned char *) strstr( private_key, "-----BEGIN EC PRIVATE KEY-----");
    footer = (unsigned char *) strstr( private_key, "-----END EC PRIVATE KEY-----");

    if( header != NULL && footer != NULL && (const char *)header == private_key )
    {
        *private_key_type = NX_SECURE_X509_KEY_TYPE_EC_DER;
        return 0;
    }

    return -1;
}

static INT cy_tls_convert_pem_to_der(const unsigned char *base64input, UINT inputlen, cy_tls_pem_type_t type, unsigned char *output, UINT *outputlen)
{
    const unsigned char *header=NULL;
    const unsigned char *footer=NULL;
    const unsigned char *end = NULL;
    int error, header_len = 0, footer_len = 0, used_len = 0;

    if(type == CY_TLS_PEM_TYPE_KEY)
    {
        UINT private_key_type;
        /* Find private key type */
        error = cy_tls_parse_private_key((const char *)base64input, &private_key_type);
        if(error == -1)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid private keys \r\n");
            return -1;
        }

        if(private_key_type == NX_SECURE_X509_KEY_TYPE_RSA_PKCS1_DER)
        {
            header_len = strlen("-----BEGIN RSA PRIVATE KEY-----");
            footer_len = strlen("-----END RSA PRIVATE KEY-----");
            header = (unsigned char *) cy_tls_strnstr((const char *)base64input, "-----BEGIN RSA PRIVATE KEY-----", (size_t)(header_len + 1));
            footer = (unsigned char *) cy_tls_strnstr((const char *)base64input, "-----END RSA PRIVATE KEY-----", (size_t)inputlen);
        }
        else
        {
            header_len = strlen("-----BEGIN EC PRIVATE KEY-----");
            footer_len = strlen("-----END EC PRIVATE KEY-----");
            header = (unsigned char *) cy_tls_strnstr((const char *)base64input, "-----BEGIN EC PRIVATE KEY-----", (size_t)(header_len + 1));
            footer = (unsigned char *) cy_tls_strnstr((const char *)base64input, "-----END EC PRIVATE KEY-----", (size_t)inputlen);
        }
    }
    else if(type == CY_TLS_PEM_TYPE_CERT)
    {
        header_len = strlen("-----BEGIN CERTIFICATE-----");
        footer_len = strlen("-----END CERTIFICATE-----");
        header = (unsigned char *) cy_tls_strnstr((const char *)base64input, "-----BEGIN CERTIFICATE-----", (size_t)(header_len + 1));
        footer = (unsigned char *) cy_tls_strnstr((const char *)base64input, "-----END CERTIFICATE-----", (size_t)inputlen);
    }
    else
    {
        /* Invalid pem type */
        return( -1 );
    }

    if(header == NULL || footer == NULL)
    {
        return( -1 );
    }

