Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
    if(footer < header)
    {
        return(-1);
    }

    header += header_len;
    if(*header == ' ')  header++;
    if(*header == '\r') header++;
    if(*header == '\n') header++;

    end = footer + footer_len;
    if(*end == ' ' ) end++;
    if(*end == '\r') end++;
    if(*end == '\n') end++;

    used_len = end - base64input;
    if((inputlen - used_len) > 1)
    {
        /*
         * Currently only one certificate/key can be configured per request.
         * Returning error if buffer having more than one certificate/key.
         */
        return(-1);
    }

    /* Decode the PEM certificate to DER */
    error = cy_tls_base64_decode((const unsigned char *) header, footer - header, output, *outputlen, outputlen);
    if(error !=0)
    {
        return (-1);
    }

    return 0;
}

/*-----------------------------------------------------------*/
static cy_rslt_t cy_tls_internal_release_root_ca_certificates(NX_SECURE_X509_CERT *root_ca_certs, unsigned char *root_ca_cert_der)
{
    if(root_ca_certs == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }
    free(root_ca_certs);

    if(root_ca_cert_der == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }
    free(root_ca_cert_der);

    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
static cy_rslt_t cy_tls_internal_load_root_ca_certificates(NX_SECURE_X509_CERT** root_ca_certs, const char* trusted_ca_certificates, const uint32_t cert_length, unsigned char **root_ca_cert_der)
{
    INT error;
    UINT der_cert_len = 0;

    if(root_ca_certs == NULL || trusted_ca_certificates == NULL || cert_length == 0 || root_ca_cert_der == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    cy_tls_internal_release_root_ca_certificates(*root_ca_certs, *root_ca_cert_der);

    *root_ca_certs = calloc(sizeof(NX_SECURE_X509_CERT), 1);
    if(*root_ca_certs == NULL)
    {
        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }

    /* Allocate memory for DER formated rootCA certificate */
    *root_ca_cert_der = calloc(cert_length, 1);
    if(*root_ca_cert_der == NULL)
    {
        free(*root_ca_certs);
        *root_ca_certs = NULL;
        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }
    /* Convert PEM to DER */
    der_cert_len = cert_length;
    error = cy_tls_convert_pem_to_der((const unsigned char *)trusted_ca_certificates, cert_length, CY_TLS_PEM_TYPE_CERT, *root_ca_cert_der, &der_cert_len);
    if(error != 0)
    {
        free(*root_ca_certs);
        *root_ca_certs = NULL;

        free(*root_ca_cert_der);
        *root_ca_cert_der = NULL;
        return CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE;
    }

    /* Initialize the RootCA Certificate */
    error = nx_secure_x509_certificate_initialize(*root_ca_certs, *root_ca_cert_der, der_cert_len, NULL, 0, NULL, 0, NX_SECURE_X509_KEY_TYPE_NONE);
    if(error != NX_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_x509_certificate_initialize failed 0x%x\r\n", error);
        free(*root_ca_certs);
        *root_ca_certs = NULL;

        free(*root_ca_cert_der);
        *root_ca_cert_der = NULL;
        return CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE;
    }

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t nxsecure_to_tls_error(UINT error)
{
    switch (error)
    {
        case NX_SUCCESS:
            return CY_RSLT_SUCCESS;

        case NX_NO_PACKET:
            return CY_RSLT_MODULE_TLS_TIMEOUT;

        case NX_NOT_CONNECTED:
            return CY_RSLT_MODULE_TLS_SOCKET_NOT_CONNECTED;

        case NX_SECURE_TLS_ALLOCATE_PACKET_FAILED:
            return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;

        case NX_SECURE_TLS_INVALID_CERTIFICATE:
        case NX_SECURE_TLS_UNSUPPORTED_PUBLIC_CIPHER:
        case NX_SECURE_X509_INVALID_CERTIFICATE_SEQUENCE:
            return CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE;

        case NX_SECURE_PKCS1_INVALID_PRIVATE_KEY:
            return CY_RSLT_MODULE_TLS_PARSE_KEY;

        case NX_PTR_ERROR:
        case NX_INVALID_PARAMETERS:
            return CY_RSLT_MODULE_TLS_BADARG;

        default:
            return CY_RSLT_MODULE_TLS_ERROR;
    }
}

/*-----------------------------------------------------------*/
/*
 * @brief helper function to get the current time from RTC.
 */
ULONG get_current_time()
{
    time_t current_time;

    memset(&current_time, 0, sizeof(current_time));

    current_time = time(&current_time);

    return current_time;
}
/*-----------------------------------------------------------*/
/*
 * @brief Network receive helper function.
 */
static cy_rslt_t network_receive(cy_tls_context_nx_secure_t *ctx, unsigned char *buffer, uint32_t len, uint32_t timeout, uint32_t *bytes_received)
{
    UINT error;
    size_t total_received = 0;
    size_t toread = 0;
    size_t outoffset = 0;
    NX_PACKET *packet;
    ULONG bytes_copied = 0;
    *bytes_received = 0;

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    do
    {
        if (!ctx->packet)
        {
            error = nx_secure_tls_session_receive(&ctx->tls_session, &packet, NX_TIMEOUT(timeout));
            if (error != NX_SUCCESS)
            {
                /* If some amount of data already received, return success with amount of bytes received, else return error. */
                if (total_received)
                {
                    break;
                }
                else
                {
                    tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "nx_socket_receive returned 0x%02x\n", error);
                    return nxsecure_to_tls_error(error);
                }
            }

            if (packet->nx_packet_length == 0)
            {
                nx_packet_release(packet);
                ctx->packet = NULL;
                continue;
            }
            ctx->packet = packet;
            ctx->offset = 0;
        }

        /*
         * This is the data left to read
         */

