Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
        toread = len - total_received;
        if (toread > ctx->packet->nx_packet_length - ctx->offset)
        {
            toread = ctx->packet->nx_packet_length - ctx->offset;
        }

        /*
         * Copy the data out
         */

        error = nx_packet_data_extract_offset(ctx->packet, ctx->offset, buffer + outoffset, toread, &bytes_copied);
        if (error != NX_SUCCESS)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error getting packet data\n");
            return nxsecure_to_tls_error(error);
        }
        ctx->offset += bytes_copied;

        /*
         * Keep track of the total received
         */

        total_received += bytes_copied;

        /*
         * Move the output pointer for the output buffer
         */

        outoffset += bytes_copied;

        /*
         * If we used up the current packet, we need to release it.
         * This will force another network read the next time through the loop.
         */

        if (ctx->offset >= ctx->packet->nx_packet_length)
        {
            nx_packet_release(ctx->packet);
            ctx->packet = NULL;
            ctx->offset = 0;
        }

    } while (total_received < len);

    *bytes_received = total_received;

    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_release_global_root_ca_certificates(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    result = cy_tls_internal_release_root_ca_certificates(root_ca_certificates, root_ca_certificates_der);
    if(result != CY_RSLT_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_release_global_root_ca_certificates failed\r\n");
    }
    root_ca_certificates = NULL;
    root_ca_certificates_der = NULL;

    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_load_global_root_ca_certificates(const char *trusted_ca_certificates, const uint32_t cert_length)
{
    return cy_tls_internal_load_root_ca_certificates(&root_ca_certificates, trusted_ca_certificates, cert_length, &root_ca_certificates_der);
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_init(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if (!init_ref_count)
    {
        nx_secure_tls_initialize();
    }

    init_ref_count++;

    return result;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_create_identity(const char *certificate_data, const uint32_t certificate_len, const char *private_key, uint32_t private_key_len, void **tls_identity)
{
    cy_tls_identity_t *identity = NULL;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    UINT error = 0;
    UINT der_cert_len = 0;
    UINT der_key_len = 0;
    UINT private_key_type;

    if (tls_identity == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    if (((certificate_data == NULL) || (certificate_len == 0)) || ((private_key == NULL) || (private_key_len == 0)))
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "certificate or private keys are empty \r\n");
        return CY_RSLT_MODULE_TLS_BAD_INPUT_DATA;
    }

    /* Find private key type */
    error = cy_tls_parse_private_key(private_key, &private_key_type);
    if ( error == -1 )
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid private keys \r\n");
        return CY_RSLT_MODULE_TLS_PARSE_KEY;
    }

    identity = calloc(sizeof(cy_tls_identity_t), 1);
    if (identity == NULL)
    {
        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }

    /* Allocate memory for certificate's DER data. */
    identity->certificate_der = calloc(certificate_len, 1);
    if(identity->certificate_der == NULL)
    {
        free(identity);
        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }

    /* Allocate memory for privatekey's DER data. */
    identity->private_key_der = calloc(private_key_len, 1);
    if(identity->private_key_der == NULL)
    {
        free(identity->certificate_der);
        free(identity);
        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }

    /* Convert PEM certificate to DER format */
    der_cert_len = certificate_len;
    error = cy_tls_convert_pem_to_der((const unsigned char *)certificate_data, certificate_len, CY_TLS_PEM_TYPE_CERT, identity->certificate_der, &der_cert_len);
    if(error != 0)
    {
        free(identity->certificate_der);
        free(identity->private_key_der);
        free(identity);
        return CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE;
    }

    /* Convert PEM key to DER format */
    der_key_len = private_key_len;
    error = cy_tls_convert_pem_to_der((const unsigned char *)private_key, private_key_len, CY_TLS_PEM_TYPE_KEY, identity->private_key_der, &der_key_len);
    if(error != 0)
    {
        free(identity->certificate_der);
        free(identity->private_key_der);
        free(identity);
        return CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE;
    }

    /* Initialize the certificates */
    error = nx_secure_x509_certificate_initialize(&identity->certificate, (unsigned char *)identity->certificate_der, der_cert_len, NULL, 0, (const unsigned char *)identity->private_key_der, der_key_len, private_key_type);
    if (error != NX_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_x509_certificate_initialize failed with error : 0x%x \r\n", error);
        free(identity->certificate_der);
        free(identity->private_key_der);
        free(identity);
        return nxsecure_to_tls_error(error);
    }
    else
    {
        *tls_identity = identity;
    }

    return result;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_delete_identity(void *tls_identity )
{
    cy_tls_identity_t *identity = (cy_tls_identity_t *)tls_identity;
    if (identity == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    if(identity->certificate_der)
    {
        free(identity->certificate_der);
    }

    if(identity->private_key_der)
    {
        free(identity->private_key_der);
    }

