Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
    free(identity);
    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_create_context(void **context, cy_tls_params_t *params)
{
    cy_tls_context_nx_secure_t *ctx = NULL;

    if (context == NULL || params == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    ctx = calloc(sizeof(cy_tls_context_nx_secure_t), 1);
    if (ctx == NULL)
    {
        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }

    *context = ctx;

    ctx->nx_tcp_socket = *(NX_TCP_SOCKET **)params->context;
    ctx->tls_identity = params->tls_identity;
    ctx->rootca_certificate = params->rootca_certificate;
    ctx->rootca_certificate_length = params->rootca_certificate_length;
    ctx->auth_mode = params->auth_mode;
    ctx->alpn_list = params->alpn_list;
    ctx->mfl_code  = params->mfl_code;
    ctx->hostname  = params->hostname;

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT

    ctx->load_rootca_from_ram  = params->load_rootca_from_ram;
    ctx->load_device_cert_key_from_ram = params->load_device_cert_key_from_ram;

    /* Get the function pointer list for the PKCS#11 module. */
    function_list = C_GetFunctionList;
    pkcs_result = function_list(&ctx->pkcs_context.functionlist);

    if(pkcs_result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : C_GetFunctionList failed with error : 0x%x \r\n", pkcs_result);
        free(ctx);
        *context = NULL;
        return convert_pkcs_error_to_tls(pkcs_result);
    }

    /* Ensure that the PKCS #11 module is initialized and create a session. */
    pkcs_result = xInitializePkcs11Session(&ctx->pkcs_context.session);

    if(pkcs_result == CKR_CRYPTOKI_ALREADY_INITIALIZED)
    {
        /* Module was previously initialized */
    }
    else
    {
        if(pkcs_result != CKR_OK)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : xInitializePkcs11Session failed with error : 0x%x \r\n", pkcs_result);
            free(ctx);
            *context = NULL;
            return convert_pkcs_error_to_tls(pkcs_result);
        }
    }
#endif

    return CY_RSLT_SUCCESS;
}

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
static int cy_tls_sign_with_private_key(void* context, mbedtls_md_type_t xMdAlg, const unsigned char* hash,
                                        size_t hash_len, unsigned char* pucSig, size_t* pxSigLen,
                                        int (*piRng)(void*, unsigned char *, size_t), void* pvRng )
{
    CK_RV result = CKR_OK;
    cy_tls_context_mbedtls_t* tls_context = (cy_tls_context_mbedtls_t*) context;
    CK_MECHANISM xMech = {0};
    CK_BYTE xToBeSigned[256];
    CK_ULONG xToBeSignedLen = sizeof(xToBeSigned);

    if(context == NULL)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : TLS context is NULL \r\n");
        return -1;
    }

    /* Sanity check buffer length. */
    if(hash_len > sizeof(xToBeSigned))
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : buffer not sufficient \r\n");
        return -1;
    }

    /* Format the hash data to be signed. */
    if(tls_context->pkcs_context.key_type == CKK_RSA)
    {
        xMech.mechanism = CKM_RSA_PKCS;

        /* mbedTLS expects hashed data without padding, but PKCS #11 C_Sign function performs a hash
         * & sign if hash algorithm is specified.  This helper function applies padding
         * indicating data was hashed with SHA-256 while still allowing pre-hashed data to
         * be provided. */
        result = vAppendSHA256AlgorithmIdentifierSequence((uint8_t*)hash, xToBeSigned );
        if(result != CKR_OK)
        {
            return -1;
        }
        xToBeSignedLen = pkcs11RSA_SIGNATURE_INPUT_LENGTH;
    }
    else if(tls_context->pkcs_context.key_type == CKK_EC)
    {
        xMech.mechanism = CKM_ECDSA;
        memcpy(xToBeSigned, hash, hash_len);
        xToBeSignedLen = hash_len;
    }
    else
    {
        return -1;
    }

    /* Use the PKCS#11 module to sign. */
    result = tls_context->pkcs_context.functionlist->C_SignInit(tls_context->pkcs_context.session, &xMech, tls_context->pkcs_context.privatekey_obj);
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : C_SignInit failed with error : %d \r\n", result);
        return -1;
    }

    *pxSigLen = sizeof( xToBeSigned );
    result = tls_context->pkcs_context.functionlist->C_Sign((CK_SESSION_HANDLE)tls_context->pkcs_context.session, xToBeSigned,
                                                      xToBeSignedLen, pucSig, (CK_ULONG_PTR) pxSigLen);
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : C_Sign failed with error : %d \r\n", result);
        return -1;
    }

    if(tls_context->pkcs_context.key_type == CKK_EC)
    {
        /* PKCS #11 for P256 returns a 64-byte signature with 32 bytes for R and 32 bytes for S.
         * This must be converted to an ASN.1 encoded array. */
        if(pkcs11ECDSA_P256_SIGNATURE_LENGTH != *pxSigLen)
        {
            return -1;
        }

        if(result == CKR_OK)
        {
            PKI_pkcs11SignatureTombedTLSSignature( pucSig, pxSigLen );
        }
    }

    return 0;
}

/* Read RootCA certificate/ device certificate from secure element through PKCS interface
 * and load into the MBEDTLS context */
static CK_RV cy_tls_read_certificate(cy_tls_context_mbedtls_t* context, char *label_name, CK_OBJECT_CLASS obj_class, mbedtls_x509_crt* cert_context)
{
    CK_RV result = CKR_OK;
    CK_ATTRIBUTE xTemplate = {0};
    CK_OBJECT_HANDLE obj_cert = 0;
    int mbedtls_result = 0;

    /* Get the handle of the certificate. */
    result = xFindObjectWithLabelAndClass(context->pkcs_context.session, label_name, strlen(label_name), obj_class, &obj_cert);
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : xFindObjectWithLabelAndClass failed with error : %d \r\n", result);
        return result;
    }

    if(obj_cert == CK_INVALID_HANDLE)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : Failed to get the handle of the certificate \r\n");
        return CKR_OBJECT_HANDLE_INVALID;
    }

    /* Query the certificate size. */
    xTemplate.type = CKA_VALUE;
    xTemplate.ulValueLen = 0;
    xTemplate.pValue = NULL;
    result = context->pkcs_context.functionlist->C_GetAttributeValue(context->pkcs_context.session, obj_cert, &xTemplate, 1);
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : C_GetAttributeValue failed with error : %d \r\n", result);
        return result;
    }

