Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
    /* Create a buffer for the certificate. */
    xTemplate.pValue = malloc(xTemplate.ulValueLen);
    if(xTemplate.pValue == NULL)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : Failed to create buffer for the certificate \r\n");
        return CKR_HOST_MEMORY;
    }

    /* Export the certificate. */
    result = context->pkcs_context.functionlist->C_GetAttributeValue(context->pkcs_context.session, obj_cert, &xTemplate, 1);
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : C_GetAttributeValue failed with error : %d \r\n", result);
        goto cleanup;
    }

    /* Decode the certificate. */
    mbedtls_result = mbedtls_x509_crt_parse(cert_context, (const unsigned char*) xTemplate.pValue, xTemplate.ulValueLen);
    if(mbedtls_result != 0)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "mbedtls_x509_crt_parse failed to parse certificate : 0x%x \r\n", mbedtls_result);
        result = CKR_GENERAL_ERROR;
        goto cleanup;
    }

cleanup:
    /* Free memory. */
    if(xTemplate.pValue != NULL)
    {
        free(xTemplate.pValue);
    }

    return result;
}

/* Setup the hardware cryptographic context  */
static CK_RV cy_tls_initialize_client_credentials(cy_tls_context_mbedtls_t* context)
{
    CK_RV result = CKR_OK;
    CK_ATTRIBUTE xTemplate[ 2 ];
    mbedtls_pk_type_t mbedtls_key_algo = ( mbedtls_pk_type_t ) ~0;
    int mbedtls_result = 0;

    if(context->pkcs_context.session == CK_INVALID_HANDLE)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : session is not initialized \r\n");
        return CKR_SESSION_HANDLE_INVALID;
    }

    result = context->pkcs_context.functionlist->C_Login(context->pkcs_context.session, CKU_USER, (CK_UTF8CHAR_PTR)configPKCS11_DEFAULT_USER_PIN,
                                                         sizeof(configPKCS11_DEFAULT_USER_PIN) - 1);
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : C_Login failed with error : %d \r\n", result);
        return result;
    }

    /* Get the handle of the device private key. */
    result = xFindObjectWithLabelAndClass(context->pkcs_context.session, pkcs11configLABEL_DEVICE_PRIVATE_KEY_FOR_TLS,
                                          sizeof( pkcs11configLABEL_DEVICE_PRIVATE_KEY_FOR_TLS ) - 1,
                                          CKO_PRIVATE_KEY,
                                          &context->pkcs_context.privatekey_obj);
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : xFindObjectWithLabelAndClass failed with error : %d \r\n", result);
        return result;
    }

    if(context->pkcs_context.privatekey_obj == CK_INVALID_HANDLE)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : Private key not found \r\n", result);
        return CKR_GENERAL_ERROR;
    }

    /* Query the device private key type. */
    xTemplate[0].type = CKA_KEY_TYPE;
    xTemplate[0].pValue = &context->pkcs_context.key_type;
    xTemplate[0].ulValueLen = sizeof(CK_KEY_TYPE);

    result = context->pkcs_context.functionlist->C_GetAttributeValue(context->pkcs_context.session, context->pkcs_context.privatekey_obj, xTemplate, 1);
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : C_GetAttributeValue failed with error : %d \r\n", result);
        return result;
    }

    /* Map the PKCS #11 key type to an mbedTLS algorithm. */
    switch(context->pkcs_context.key_type)
    {
        case CKK_RSA:
        {
            mbedtls_key_algo = MBEDTLS_PK_RSA;
            break;
        }

        case CKK_EC:
        {
            mbedtls_key_algo = MBEDTLS_PK_ECKEY;
            break;
        }

        default:
        {
            result = CKR_ATTRIBUTE_VALUE_INVALID;
            return result;
        }
    }

    /* Map the mbedTLS algorithm to its internal metadata. */
    memcpy(&context->pkcs_context.ssl_pk_info, mbedtls_pk_info_from_type(mbedtls_key_algo), sizeof(mbedtls_pk_info_t));

    context->pkcs_context.ssl_pk_info.sign_func = cy_tls_sign_with_private_key;
    context->pkcs_context.ssl_pk_ctx.pk_info = &context->pkcs_context.ssl_pk_info;
    context->pkcs_context.ssl_pk_ctx.pk_ctx = context;

    result = cy_tls_read_certificate(context, pkcs11configLABEL_DEVICE_CERTIFICATE_FOR_TLS, CKO_CERTIFICATE, context->cert_client );
    if(result != CKR_OK)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "PKCS : failed to read device certificate : %d \r\n", result);
        return result;
    }

    mbedtls_result = mbedtls_ssl_conf_own_cert(&context->ssl_config, context->cert_client, &context->pkcs_context.ssl_pk_ctx );
    if(mbedtls_result != 0)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "mbedtls_ssl_conf_own_cert failed to load certificate & key : %d \r\n", mbedtls_result);
        return CKR_GENERAL_ERROR;
    }

    return result;
}
#endif


/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_connect(void *context, cy_tls_endpoint_type_t endpoint, uint32_t timeout)
{
    cy_tls_context_nx_secure_t *ctx = (cy_tls_context_nx_secure_t *) context;
    UINT error;
    cy_tls_identity_t *tls_identity;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    bool load_cert_key_from_ram = CY_TLS_LOAD_CERT_FROM_RAM;
    ULONG metadata_size;
    NX_SECURE_X509_DNS_NAME dns_name;
    bool tls_session_created = false;

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
    CK_RV pkcs_result = CKR_OK;
#endif
    if (ctx == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    tls_identity = (cy_tls_identity_t *)ctx->tls_identity;

    /* Find meta-data size that is needed for TLS session creation. */
    error = nx_secure_tls_metadata_size_calculate(&cy_tls_ciphers, &metadata_size);

    if (error != NX_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_metadata_size_calculate failed 0x%x\r\n", error);
        return CY_RSLT_MODULE_TLS_ERROR;
    }

    /* Allocate memory for TLS meta-data */
    ctx->tls_metadata = calloc(metadata_size, 1);
    if (ctx->tls_metadata == NULL)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to allocate memory for tls meta data \r\n");
        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }
    /* Create TLS session */

