Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
    error = nx_secure_tls_session_create(&ctx->tls_session, &cy_tls_ciphers, ctx->tls_metadata, metadata_size);
    if (error == NX_SUCCESS)
    {
        tls_session_created = true;
#ifdef NX_SECURE_ENABLE_ECC_CIPHERSUITE
        error = nx_secure_tls_ecc_initialize(&ctx->tls_session, nx_crypto_ecc_supported_groups, nx_crypto_ecc_supported_groups_size, nx_crypto_ecc_curves);
        if (error != NX_SUCCESS)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_ecc_initialize failed 0x%x\r\n", error);
            result = CY_RSLT_MODULE_TLS_ERROR;
            goto cleanup;
        }
#endif
    }

    if (error != NX_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_session_create failed 0x%x\r\n", error);
        result = CY_RSLT_MODULE_TLS_ERROR;
        goto cleanup;
    }

    /* Allocate memory for TLS re-assembly buffer */
    ctx->tls_packet_buffer = malloc(CY_TLS_PACKET_BUFFER_SIZE);
    if (ctx->tls_packet_buffer == NULL)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to allocate memory for tls packet buffer \r\n");
        result = CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
        goto cleanup;
    }

    error = nx_secure_tls_session_packet_buffer_set(&ctx->tls_session, ctx->tls_packet_buffer, CY_TLS_PACKET_BUFFER_SIZE);
    if (error != NX_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_session_packet_buffer_set failed 0x%x\r\n", error);

        result = CY_RSLT_MODULE_TLS_ERROR;
        goto cleanup;
    }

#ifdef NX_SECURE_ENABLE_CLIENT_CERTIFICATE_VERIFY
    if (endpoint == CY_TLS_ENDPOINT_SERVER)
    {
        if (ctx->auth_mode == CY_TLS_AUTH_MODE_VERIFY_NONE || ctx->auth_mode == CY_TLS_AUTH_MODE_VERIFY_OPTIONAL)
        {
            error = nx_secure_tls_session_client_verify_disable(&ctx->tls_session);
            if (error != NX_SUCCESS)
            {
                tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_session_client_verify_disable/enable failed 0x%x\r\n", error);

                result = CY_RSLT_MODULE_TLS_ERROR;
                goto cleanup;
            }
        }
        else
        {
            ctx->certificate_buffer = malloc(CY_TLS_MAX_CERTIFICATE_SIZE * CY_TLS_MAX_NUM_CERTS);
            if (ctx->tls_packet_buffer == NULL)
            {
                tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to allocate memory for remote certificate buffer \r\n");
                result = CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
                goto cleanup;
            }

            /* Enable client X.509 verification and allocate space for client certificates. */
            error = nx_secure_tls_session_x509_client_verify_configure(&ctx->tls_session, CY_TLS_MAX_NUM_CERTS, ctx->certificate_buffer, CY_TLS_MAX_CERTIFICATE_SIZE * CY_TLS_MAX_NUM_CERTS);
            if (error != NX_SUCCESS)
            {
                tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_session_x509_client_verify_configure failed 0x%x\r\n", error);

                result = CY_RSLT_MODULE_TLS_ERROR;
                goto cleanup;
            }
        }
    }
#endif
    if (endpoint == CY_TLS_ENDPOINT_CLIENT)
    {
        ctx->certificate_buffer = calloc((CY_TLS_MAX_CERTIFICATE_SIZE * CY_TLS_MAX_NUM_CERTS), 1);
        if (ctx->tls_packet_buffer == NULL)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to allocate memory for remote certificate buffer \r\n");
            result = CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
            goto cleanup;
        }

        error = nx_secure_tls_remote_certificate_buffer_allocate(&ctx->tls_session, CY_TLS_MAX_NUM_CERTS, ctx->certificate_buffer, CY_TLS_MAX_CERTIFICATE_SIZE * CY_TLS_MAX_NUM_CERTS);
        if (error != NX_SUCCESS)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_remote_certificate_buffer_allocate failed 0x%x\r\n", error);
            result = CY_RSLT_MODULE_TLS_ERROR;
            goto cleanup;
        }
    }

    if (ctx->hostname)
    {
        /* Initialize the DNS server name we want to send in the SNI extension. */
        nx_secure_x509_dns_name_initialize(&dns_name, (unsigned char *)ctx->hostname, strlen(ctx->hostname));

        /* The SNI server name needs to be set prior to starting the TLS session. */
        nx_secure_tls_session_sni_extension_set(&ctx->tls_session, &dns_name);
    }


#ifdef ENABLE_HAVE_DATE_TIME
    /* ToDo:If the time function is set to the NXSecure TLS session, during TLS handshake it verifies the certificates expiry time.
     * Application should initialize the platform time. For now disabled this code under ENABLE_HAVE_DATE_TIME define. This define is not
     * a NetXSecure define. Need to find a correct way for user to enable this define. */
    error = nx_secure_tls_session_time_function_set(&ctx->tls_session, get_current_time);
    if (error != NX_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_session_time_function_set failed 0x%x\r\n", error);

        result = CY_RSLT_MODULE_TLS_ERROR;
        goto cleanup;
    }

#endif

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
    /* If CY_SECURE_SOCKETS_PKCS_SUPPORT flag is enabled and ctx->load_rootca_from_ram flag is not set through
     * cy_socket_setsockopt then use the rootCA certificate which was provisioned to secure element else read from the
     * RAM
     */
    if(ctx->load_rootca_from_ram == CY_TLS_LOAD_CERT_FROM_SECURE_STORAGE)
    {
        load_cert_key_from_ram = CY_TLS_LOAD_CERT_FROM_SECURE_STORAGE;

        ctx->cert_x509ca = malloc(sizeof(mbedtls_x509_crt));
        if(ctx->cert_x509ca == NULL)
        {
            return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
        }

        mbedtls_x509_crt_init(ctx->cert_x509ca);

        /* Read rootCA certificate */
        result = cy_tls_read_certificate(ctx, pkcs11configLABEL_ROOT_CERTIFICATE, CKO_CERTIFICATE, ctx->cert_x509ca);

        /* If reading RootCA certificate fails then continue with TLS handshake as TLS handshake may
         * go through if server certificate doesnt need to be verified */
        if(result == CKR_OK)
        {
            mbedtls_ssl_conf_ca_chain(&ctx->ssl_config, ctx->cert_x509ca, NULL);
        }
        else
        {
            cy_tls_internal_release_root_ca_certificates(ctx->cert_x509ca, ctx->rootca_der);
            ctx->cert_x509ca = NULL;
            ctx->rootca_der = NULL;
        }
    }
#endif

