Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
    if (load_cert_key_from_ram == CY_TLS_LOAD_CERT_FROM_RAM)
    {
        if(ctx->rootca_certificate)
        {
            cy_tls_internal_load_root_ca_certificates(&ctx->nx_secure_ca_cert, ctx->rootca_certificate,  ctx->rootca_certificate_length, &ctx->rootca_der);
            error = nx_secure_tls_trusted_certificate_add(&ctx->tls_session, ctx->nx_secure_ca_cert);
            if (error != NX_SUCCESS)
            {
                tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_trusted_certificate_add failed 0x%x\r\n", error);

                result = CY_RSLT_MODULE_TLS_ERROR;
                goto cleanup;
            }
        }
        else if (root_ca_certificates)
        {
            error = nx_secure_tls_trusted_certificate_add(&ctx->tls_session, root_ca_certificates);
            if (error != NX_SUCCESS)
            {
                tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_trusted_certificate_add failed 0x%x\r\n", error);

                result = CY_RSLT_MODULE_TLS_ERROR;
                goto cleanup;
            }
        }
    }

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
    if(ctx->load_device_cert_key_from_ram == CY_TLS_LOAD_CERT_FROM_SECURE_STORAGE)
    {
        load_cert_key_from_ram = CY_TLS_LOAD_CERT_FROM_SECURE_STORAGE;

        ctx->cert_client = malloc(sizeof(mbedtls_x509_crt));
        if(ctx->cert_client == NULL)
        {
            result = CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
            goto cleanup;
        }

        mbedtls_x509_crt_init(ctx->cert_client);

        /* If reading provisioned device certificate and keys failed from secure element. still continue the TLS
         * handshake. as for server which doesnt require mutual authentication may successully complete the TLS handshake
         */
        pkcs_result = cy_tls_initialize_client_credentials(ctx);
        if(pkcs_result != CKR_OK)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Reading device credentials from secure element failed with error %d \r\n", pkcs_result);
            mbedtls_x509_crt_free(ctx->cert_client);
            free(ctx->cert_client);
            ctx->cert_client = NULL;
        }
    }
    else
    {
        load_cert_key_from_ram = CY_TLS_LOAD_CERT_FROM_RAM;
    }
#endif

    if (load_cert_key_from_ram == CY_TLS_LOAD_CERT_FROM_RAM)
    {
        if (tls_identity)
        {
            error = nx_secure_tls_local_certificate_add(&ctx->tls_session, &tls_identity->certificate);
            if (error != NX_SUCCESS)
            {
                tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_local_certificate_add failed 0x%x\r\n", error);

                result = CY_RSLT_MODULE_TLS_ERROR;
                goto cleanup;
            }
        }
    }

    tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Performing the TLS handshake\r\n");

    error = nx_secure_tls_session_start(&ctx->tls_session, ctx->nx_tcp_socket, NX_TIMEOUT(timeout));
    if (error != NX_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_session_start failed 0x%x\r\n", error);
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
            if(pkcs_result != CKR_OK)
            {
                tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "TLS handshake failed and it is likely that device certificate & keys are not provisioned or they are incorrect" \
                                                             "Please check the provisioned device certificate and keys \r\n");
            }
#endif
        result = CY_RSLT_MODULE_TLS_ERROR;
        goto cleanup;
    }

    ctx->tls_handshake_successful = true;
    tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "TLS handshake successful \r\n");

    return CY_RSLT_SUCCESS;

cleanup:
    if (tls_session_created)
    {
        nx_secure_tls_session_end(&ctx->tls_session, NX_WAIT_FOREVER);
        nx_secure_tls_session_delete(&ctx->tls_session);
    }

    if (ctx->tls_metadata)
    {
        free(ctx->tls_metadata);
        ctx->tls_metadata = NULL;
    }

    if (ctx->tls_packet_buffer)
    {
        free(ctx->tls_packet_buffer);
        ctx->tls_packet_buffer = NULL;
    }

    if (ctx->nx_secure_ca_cert)
    {
        cy_tls_internal_release_root_ca_certificates(ctx->nx_secure_ca_cert, ctx->rootca_der);
        ctx->nx_secure_ca_cert = NULL;
        ctx->rootca_der = NULL;
    }

    if (ctx->certificate_buffer)
    {
        free(ctx->certificate_buffer);
        ctx->certificate_buffer = NULL;
    }

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
    if(ctx->cert_x509ca != NULL)
    {
        mbedtls_x509_crt_free(ctx->cert_x509ca);
        free(ctx->cert_x509ca);
        ctx->cert_x509ca = NULL;
    }

    if(ctx->cert_client != NULL)
    {
        mbedtls_x509_crt_free(ctx->cert_client);
        free(ctx->cert_client);
        ctx->cert_client = NULL;
    }
#endif

    return result;
}


/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_send(void *context, const unsigned char *data, uint32_t length, uint32_t timeout, uint32_t *bytes_sent)
{
    cy_tls_context_nx_secure_t *ctx = (cy_tls_context_nx_secure_t *) context;
    NX_PACKET *packet = NULL;
    NX_PACKET_POOL *pool;
    UINT error;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    uint32_t size;

    if (context == NULL || data == NULL || length == 0 || bytes_sent == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    *bytes_sent = 0;

    if (!ctx->tls_handshake_successful)
    {
        return CY_RSLT_MODULE_TLS_ERROR;
    }

    /* Get packet pool to allocate a packet */
    result = cy_network_get_packet_pool(CY_NETWORK_PACKET_TX, (void *)&pool);
    if (result != CY_RSLT_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_netxduo_get_tls_packet failed with error %d\n", result);

        return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
    }

    while ((length - *bytes_sent) > 0)
    {
        size = length - *bytes_sent;

        /* Get a packet from the pool to send encrypted data. */
        error = nx_secure_tls_packet_allocate(&ctx->tls_session, pool, &packet, timeout);
        if (error != NX_SUCCESS)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to allocate packet: 0x%02x\n", error);
            return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;
        }

