Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/secure-sockets/source/COMPONENT_NETXSECURE/cy_tls.c
        /*
         * Make sure we aren't trying to send more data than we have room for in the packet.
         */
        if (size > (uint32_t)(packet->nx_packet_data_end - packet->nx_packet_append_ptr))
        {
            size = (uint32_t)(packet->nx_packet_data_end - packet->nx_packet_append_ptr);
        }

        /* Populate the packet with input data. */
        error = nx_packet_data_append(packet, (void *)(data + *bytes_sent), size, pool, NX_TIMEOUT(timeout));
        if (error != NX_SUCCESS)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_packet_data_append failed 0x%x\r\n", error);
            nx_secure_tls_packet_release(packet);
            return CY_RSLT_MODULE_TLS_ERROR;
        }

        /* Send data through a NetX SecureTLS Session. */
        error = nx_secure_tls_session_send(&ctx->tls_session, packet, NX_TIMEOUT(timeout));
        if (error != NX_SUCCESS)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "tls session send failed 0x%x\r\n", error);
            nx_secure_tls_packet_release(packet);
            return CY_RSLT_MODULE_TLS_ERROR;
        }
        /* update bytes sent */
        *bytes_sent += size;
    }
    return result;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_recv(void *context, unsigned char *buffer, uint32_t length, uint32_t timeout, uint32_t *bytes_received)
{
    cy_tls_context_nx_secure_t *ctx = (cy_tls_context_nx_secure_t *) context;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if (context == NULL || buffer == NULL || length == 0 || bytes_received == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    *bytes_received = 0;

    if (!ctx->tls_handshake_successful)
    {
        return CY_RSLT_MODULE_TLS_ERROR;
    }

    /* Receive the packet */
    result = network_receive(ctx, buffer, length, timeout, bytes_received);
    if (result != CY_RSLT_SUCCESS)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "network_receive failed\n");
        *bytes_received = 0;
    }

    return result;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_delete_context(cy_tls_context_t context)
{
    UINT error;
    cy_tls_context_nx_secure_t *ctx = (cy_tls_context_nx_secure_t *) context;

    if (context == NULL)
    {
        return CY_RSLT_MODULE_TLS_BADARG;
    }

    if (ctx->nx_secure_ca_cert)
    {
        cy_tls_internal_release_root_ca_certificates(ctx->nx_secure_ca_cert, ctx->rootca_der);
        ctx->nx_secure_ca_cert = NULL;
        ctx->rootca_der = NULL;
    }

    if (ctx->tls_handshake_successful)
    {
        /* Cleanup TLS session. */
        error = nx_secure_tls_session_end(&ctx->tls_session, NX_WAIT_FOREVER);
        if (error != NX_SUCCESS)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_session_end failed 0x%x\r\n", error);
        }

        error = nx_secure_tls_session_delete(&ctx->tls_session);
        if (error != NX_SUCCESS)
        {
            tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_secure_tls_session_delete failed 0x%x\r\n", error);
        }
    }

    if(ctx->packet)
    {
        nx_packet_release(ctx->packet);
        ctx->packet = NULL;
    }

    if (ctx->tls_metadata)
    {
        free(ctx->tls_metadata);
        ctx->tls_metadata = NULL;
    }

    if (ctx->tls_packet_buffer)
    {
        free(ctx->tls_packet_buffer);
        ctx->tls_packet_buffer = NULL;
    }

    if (ctx->certificate_buffer)
    {
        free(ctx->certificate_buffer);
        ctx->certificate_buffer = NULL;
    }

    if (ctx->nx_secure_ca_cert)
    {
        cy_tls_internal_release_root_ca_certificates(ctx->nx_secure_ca_cert, ctx->rootca_der);
        ctx->nx_secure_ca_cert = NULL;
        ctx->rootca_der = NULL;
    }

#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
    if((ctx->pkcs_context.functionlist != NULL) && (ctx->pkcs_context.functionlist->C_CloseSession != NULL) && (ctx->pkcs_context.session != CK_INVALID_HANDLE))
    {
        ctx->pkcs_context.functionlist->C_CloseSession(ctx->pkcs_context.session);
    }

    if(ctx->cert_x509ca != NULL)
    {
        mbedtls_x509_crt_free(ctx->cert_x509ca);
        free(ctx->cert_x509ca);
        ctx->cert_x509ca = NULL;
    }

    if(ctx->cert_client != NULL)
    {
        mbedtls_x509_crt_free(ctx->cert_client);
        free(ctx->cert_client);
        ctx->cert_client = NULL;
    }
#endif

    free(context);
    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_tls_deinit(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if (!init_ref_count)
    {
        tls_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "library not initialized\n");
        return CY_RSLT_MODULE_TLS_ERROR;
    }
    init_ref_count--;

    return result;
}
/*-----------------------------------------------------------*/
#else
#endif /* USE_TLS_WEAK */
